{
  "part1_ratings": [
    {
      "video_id": "video_1769884200818389269",
      "video_path": "media/v_1769884200818389269_OM_cnGr9ZV6CKcY7.mp4",
      "video_summary": "During daytime in clear, sunny conditions in Japan, a vehicle-mounted camera on a motorcycle captured an instance of unsafe driving behavior and a traffic violation. A car driver obstructed the path of the motorcycle and complained to the rider, despite the motorcycle legally using the road. The road was marked as one-way for other vehicles but included an exception for two-wheelers and bicycles, which the motorcycle rider was adhering to. The car driver's actions constituted obstruction of traffic and potentially failing to yield right of way to the legally present motorcycle.",
      "road_event_answer": "A car driver obstructs and complains to a motorcyclist legally using a one-way street.",
      "distractor_answers": [
        "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend.",
        "A compilation shows multiple traffic violations in Hyderabad, including improper U-turns, speeding, and red light jumping.",
        "A scooter rider opens the door of a car, causing a passing pedestrian to fall."
      ],
      "captions": [
        {
          "caption_id": "video_1769884200818389269_caption1",
          "text": "Car driver blocks legally permitted motorcycle on a one-way street, committing clear traffic obstruction.",
          "control_scores": {
            "tone": {
              "Critical": "Strong"
            },
            "writing_style": {
              "Factual": "Strong"
            }
          },
          "application": "Law Enforcement Reporting"
        },
        {
          "caption_id": "video_1769884200818389269_caption2",
          "text": "Just out here minding my ride while drama unfolds 😂🛵",
          "control_scores": {
            "tone": {
              "Amusing": "Very Strong",
              "Casual": "Strong"
            },
            "writing_style": {
              "Conversational": "Strong"
            }
          },
          "application": "Urban Traffic Observation"
        },
        {
          "caption_id": "video_1769884200818389269_caption3",
          "text": "In Tokyo, a car blocked a motorcycle on a one-way street that’s open to two-wheelers. What makes drivers react this way even when the rules are clear? 🤔 Road moments like this really make you think. #JapanTraffic",
          "control_scores": {
            "tone": {
              "Curious": "Very Strong",
              "Reflective": "Very Strong"
            },
            "writing_style": {
              "Rhetorical Question": "Strong"
            }
          },
          "application": "Driver Behavior Monitoring"
        }
      ]
    },
    {
      "video_id": "video_1749410676656030046",
      "video_path": "media/v_1749410676656030046_xdazf_eJ7vCQl2YJ.mp4",
      "video_summary": "A dashcam video from India captured a near-miss incident involving unsafe overtaking on a hairpin bend. A car and a two-wheeler were attempting to overtake on the bend, while the dashcam vehicle was driving normally. The primary reason for the near-miss was the unsafe overtaking maneuver. This event involved traffic rule violations including unsafe overtaking and potentially crossing solid lane markings. The incident could have been prevented if the car and two-wheeler drivers had refrained from overtaking on the hairpin bend and followed proper road safety guidelines.",
      "road_event_answer": "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend.",
      "distractor_answers": [
        "A scooter rider opens the door of a car, causing a passing pedestrian to fall.",
        "A high-speed car crash on a highway results in a severely damaged vehicle, multiple fatalities, and injuries.",
        "A large truck performs a hazardous overtaking maneuver, ignoring oncoming traffic."
      ],
      "captions": [
        {
          "caption_id": "video_1749410676656030046_caption1",
          "text": "Today I saw a car and two-wheeler attempt unsafe overtaking on a hairpin bend, nearly resulting in a crash. Please remember, overtaking on sharp curves puts lives at risk. Let’s look out for one another. 🚫🏍️🚗 #RoadSafety #DriveResponsibly",
          "control_scores": {
            "tone": {
              "Caring": "Strong",
              "Serious": "Strong"
            },
            "writing_style": {
              "Advisory": "Strong"
            }
          },
          "application": "Public Safety Education"
        },
        {
          "caption_id": "video_1749410676656030046_caption2",
          "text": "Trying to overtake on a hairpin bend? That’s just asking for trouble. It’s baffling how some people ignore basic safety, risking lives without a second thought. This level of carelessness is unreal.",
          "control_scores": {
            "tone": {
              "Angry": "Very Strong"
            },
            "writing_style": {
              "Judgmental": "Strong"
            }
          },
          "application": "Public Safety Alert"
        },
        {
          "caption_id": "video_1749410676656030046_caption3",
          "text": "I just experienced a close call on a hairpin bend when a car and a two-wheeler tried to overtake at the same time, almost causing an accident right in front of me.",
          "control_scores": {
            "tone": {
              "Observant": "Very Strong",
              "Anxious": "Very Strong"
            },
            "writing_style": {
              "Factual": "Strong"
            }
          },
          "application": "Urban Traffic Observation"
        }
      ]
    }
  ],
  "part2_intensity_change": [
    {
      "change_id": "change_012",
      "video_id": "video_1763928814290354479",
      "video_path": "media/v_1763928814290354479_LJNZA0ytfZxtQyUO.mp4",
      "video_summary": "A vehicle-mounted camera, capturing both interior and exterior views, recorded an instance of unsafe driving behavior in the United States, possibly in the Florida Keys. The key road event involved two cars and their respective drivers. One driver abruptly cut across another driver's lane, potentially due to being in a rush or impatience. In response, the other driver likely performed a defensive or retaliatory action, possibly stemming from frustration or an attempt to teach a lesson. This incident potentially involved traffic violations such as unsafe lane change and aggressive driving.",
      "road_event_answer": "One driver abruptly cuts off another, causing an aggressive response from the second driver.",
      "distractor_answers": [
        "A massive multi-vehicle pileup on a highway caused by heavy fog.",
        "A scooter rider opens the door of a car, causing a passing pedestrian to fall.",
        "A car stops beyond the designated stop line at a red light."
      ],
      "caption_A": "Tense moments on the roads in the Florida Keys today 😬 #FloridaDriving",
      "caption_B": "Two cars encounter each other in the Florida Keys 🚗 #FloridaKeys",
      "field_to_change": {
        "tone": "Emotional"
      },
      "change_type": "decreased"
    },
      {
      "change_id": "change_009",
      "video_id": "video_1757678309222355396",
      "video_path": "media/v_1757678309222355396_u3pTKLEanaQLVVoF.mp4",
      "video_summary": "A dashcam captured a key road event in Japan during the daytime, depicting dangerous cycling behavior that constituted a traffic violation. The cyclist's actions likely involved disregarding traffic signals or improper use of the roadway. Other entities present included cars, pedestrians, crosswalks, and traffic lights.",
      "road_event_answer": "A cyclist engages in dangerous behavior, potentially disregarding traffic signals or using the roadway improperly.",
      "distractor_answers": [
        "A scooter rider opens the door of a car, causing a passing pedestrian to fall.",
        "A motorcyclist performs high-speed wheelies on a busy road with other vehicles.",
        "A motorcyclist rides recklessly, weaving between vehicles, riding no-handed, and hiding their license plate."
      ],
      "caption_A": "Seriously, what was that cyclist thinking in Japan, @JapanPolice? #Tokyo",
      "caption_B": "Wow, @JapanPolice, is reckless cycling just a Tokyo thing now? #Japan",
      "field_to_change": {
        "tone": "Sarcastic"
      },
      "change_type": "increased"
    },
    {
      "change_id": "change_005",
      "video_id": "video_1772082398257127647",
      "video_path": "media/v_1772082398257127647_PAjmPcDqmPNuvb6p.mp4",
      "video_summary": "A severe car accident, captured by multiple cameras, occurred in Brampton, Ontario, Canada. The key road event involved a dark-colored sports car that reportedly came flying over a fence at high speed, resulting in it being severely damaged and overturned with its front end crumpled and debris scattered. The driver and passenger of the sports car fled the scene, constituting a hit-and-run. A white Toyota Tacoma pickup truck was also involved, sustaining a detached front bumper. The incident took place near two-story brick residential houses and power lines. Bystanders were observed assessing the situation and offering assistance. The traffic violations associated with this event include speeding, reckless driving, and fleeing the scene of an accident.",
      "road_event_answer": "A sports car crashed at high speed, and the occupants fled the scene.",
      "distractor_answers": [
        "Multiple vehicles run a red light and make illegal U-turns while pedestrians are crossing against their signal.",
        "A motorcyclist performs a stunt by standing on the seat of their moving motorcycle.",
        "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend."
      ],
      "caption_A": "Speeding and reckless driving can lead to devastating crashes. Always stay alert and drive responsibly. 🚨 #RoadSafety #DrivingTips",
      "caption_B": "A car suddenly flips over, sending debris everywhere— so unsettling to watch. People rush away, unsure what just happened. 🚗💥 #Crash #RoadDrama",
      "field_to_change": {
        "writing_style": "Advisory"
      },
      "change_type": "decreased"
    },
    {
      "change_id": "change_010",
      "video_id": "video_1695748178056974456",
      "video_path": "media/v_1695748178056974456_FxGj0jW1c_4xuTXE.mp4",
      "video_summary": "A vehicle-mounted camera, providing a driver's perspective, captured a road event in Japan during daytime. The key event depicted dangerous driving behavior, specifically illegal turns and lane changes at intersections. A beginner driver's car (possibly a Wagon R) and a yellow car (possibly a Vitz) were observed making illegal turns or lane changes at intersections, cutting across lanes inappropriately. Traffic rule violations included illegal lane changes, improper turns at intersections, and potentially running yellow lights, involving these vehicles, traffic lights, and other vehicles in traffic.",
      "road_event_answer": "A beginner driver's car and a yellow car are seen making illegal turns/lane changes at intersections.",
      "distractor_answers": [
        "A high-speed car crash on a highway results in a severely damaged vehicle, multiple fatalities, and injuries.",
        "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend.",
        "A compilation shows multiple traffic violations in Hyderabad, including improper U-turns, speeding, and red light jumping."
      ],
      "caption_A": "Stay alert at intersections in Japan always.",
      "caption_B": "In Japan, haste makes waste at intersections.",
      "field_to_change": {
        "writing_style": "Proverbial"
      },
      "change_type": "increased"
    }
  ],
    "part3_comparisons": [
    {
      "comparison_id": "comp_001",
      "video_id": "video_1781029134916784442",
      "video_path": "media/v_1781029134916784442_HwWaSpaenWbLCXo7.mp4",
      "video_summary": "A vehicle-mounted camera captured a traffic violation at night in Brampton, Ontario, Canada. A car stopped at an intersection with traffic lights, positioning itself incorrectly beyond the designated stop line while the light was red. The road surface was wet during the event.",
      "road_event_answer": "A car stops beyond the designated stop line at a red light.",
      "distractor_answers": [
        "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend.",
        "A massive multi-vehicle pileup on a highway caused by heavy fog.",
        "A compilation shows multiple traffic violations in Hyderabad, including improper U-turns, speeding, and red light jumping."
      ],
      "control_scores": {
        "tone": {
          "Amusing": "Strong",
          "Casual": "Strong"
        },
        "writing_style": {
          "Exaggeration": "Strong"
        }
      },
      "caption_A": "Brampton nights really bringing out the creative drivers 😂. Wet roads and wild stops! #Brampton",
      "caption_B": "Brampton nights really bringing out the creative drivers 😂. Wet roads and wild stops! #Brampton"
    },
    {
      "comparison_id": "comp_017",
      "video_id": "video_1775427324160389268",
      "video_path": "media/v_1775427324160389268_77JT7vEFE5ILkG6L.mp4",
      "video_summary": "A hand-held or cell-phone camera captured a public transportation disruption in Japan, where a stray dog was lying on train tracks at a station. The key event involved a train stopping to avoid hitting the dog, which appeared comfortable and unafraid on the tracks. Passengers at the station were observed interacting with and observing the dog, with train operators and passengers seemingly motivated by concern for the dog's safety. The incident involved a stray dog, train tracks, trains, trams, and passengers.",
      "road_event_answer": "A train in Japan stops for a stray dog lying on the tracks at a station.",
      "distractor_answers": [
        "A car and a two-wheeler dangerously attempt to overtake on a hairpin bend.",
        "A motorcyclist rides recklessly, weaving between vehicles, riding no-handed, and hiding their license plate.",
        "A motorcyclist performs a stunt by standing on the seat of their moving motorcycle."
      ],
      "control_scores": {
        "tone": {
          "Sarcastic": "Strong",
          "Amusing": "Very Strong"
        },
        "writing_style": {
          "Conversational": "Strong"
        }
      },
      "caption_A": "Japan, where even stray dogs have better public transport experiences than I do 😂",
      "caption_B": "Japan, where even stray dogs have better public transport experiences than I do 😂"
    },
    {
      "comparison_id": "comp_013",
      "video_id": "video_1601008232847536128",
      "video_path": "media/v_1601008232847536128_NAijs2Y2B0AvUT_O.mp4",
      "video_summary": "A near-miss incident, captured by a vehicle-mounted camera from a driver's perspective in Australia, involved a motorcycle and a truck. The truck was in the process of turning when a motorcyclist approached at high speed. To avoid a collision, the motorcyclist performed a tactical roll. The primary reason for this near-miss was the motorcyclist's failure to slow down when approaching the turning truck, suggesting recklessness or lack of caution. The incident could have been prevented if the motorcyclist had reduced speed. Associated traffic rule violations include speeding and potentially reckless driving by the motorcyclist.",
      "road_event_answer": "A motorcyclist, approaching at high speed, performs a tactical roll to avoid colliding with a turning truck.",
      "distractor_answers": [
        "A high-speed car crash on a highway results in a severely damaged vehicle, multiple fatalities, and injuries.",
        "Multiple vehicles run a red light and make illegal U-turns while pedestrians are crossing against their signal.",
        "A scooter rider opens the door of a car, causing a passing pedestrian to fall."
      ],
      "control_scores": {
        "tone": {
          "Curious": "Very Strong"
        },
        "writing_style": {
          "Conversational": "Strong",
          "Rhetorical Question": "Strong"
        }
      },
      "caption_A": "Did anyone else catch that close call with the motorbike and turning truck? Glad everyone’s okay—@SafeDrivingAU, is this a common risk on the roads?",
      "caption_B": "Did anyone else catch that close call with the motorbike and turning truck? Glad everyone’s okay—@SafeDrivingAU, is this a common risk on the roads?"
    }
  ]
}