{
  "part1_ratings": [
    {
      "video_id": "video_003",
      "video_path": "media/v_1685698185946140672_m7xZrN10cPS2eFp6.mp4",
      "video_summary": "A dashcam video captured a near-miss accident in Canada, near Cornwall, Ontario. The key road event involved a semi-trailer truck performing an unsafe lane change, potentially without signaling or checking mirrors, nearly colliding with another vehicle (possibly a truck) traveling in the adjacent lane. The incident highlights potential traffic rule violations including unsafe lane change, failure to signal, and failure to check mirrors.",
      "road_event_answer": "A semi-truck made an unsafe lane change, nearly colliding with another vehicle.",
      "distractor_answers": [
        "A semi-truck jackknifed on a slippery road.",
        "Two trucks were involved in a minor fender-bender.",
        "A car cut off a semi-truck, causing it to brake suddenly."
      ],
      "captions": [
        {
          "caption_id": "video_003_caption1",
          "text": "Near-miss in Cornwall, Ontario: semi-truck’s unsafe lane change almost causes crash with another vehicle. 🚚 #CanadaRoads",
          "control_scores": {
            "tone": {
              "Serious": "Strong"
            },
            "writing_style": {
              "Factual": "Strong"
            }
          },
          "application": "Public Safety Alert"
        },
        {
          "caption_id": "video_003_caption2",
          "text": "I just had a wild near-miss with a semi in Cornwall, Ontario! #trucking",
          "control_scores": {
            "tone": {
              "Adventurous": "Strong",
              "Energetic": "Strong"
            },
            "writing_style": {
              "Conversational": "Very Strong"
            }
          },
          "application": "Community Road Safety Awareness"
        },
        {
          "caption_id": "video_003_caption3",
          "text": "Semi-trailer trucks pulling moves like this—unsafe lane changes, no signal, barely a glance—almost as if mirrors are just for decoration. Near Cornwall, Ontario, another close call caught on dashcam. #RoadSafety #TruckAccidents",
          "control_scores": {
            "tone": {
              "Critical": "Strong",
              "Serious": "Strong"
            },
            "writing_style": {
              "Judgmental": "Strong",
              "Factual": "Strong"
            }
          },
          "application": "Driver Behavior Monitoring"
        }
      ]
    },
    {
      "video_id": "video_002",
      "video_path": "media/v_1774263154723451187_QFMMJd8wYMEMl2r7.mp4",
      "video_summary": "A daytime near-miss incident involving dangerous driving behavior was captured by a vehicle-mounted camera in Osaka, Japan. The key road event involved the camera vehicle and a right-turning vehicle. The right-turning vehicle made a sudden and dangerous right turn, nearly colliding with the camera vehicle. This maneuver was likely due to the driver of the right-turning vehicle not paying attention or being impatient, resulting in a failure to yield right-of-way. The incident could have been avoided if the right-turning vehicle had waited for a clear opportunity to turn and checked for oncoming traffic.",
      "road_event_answer": "A vehicle makes a sudden, dangerous right turn, failing to yield and nearly colliding with the camera vehicle.",
      "distractor_answers": [
        "A group of motorcyclists were participating in an organized race.",
        "A car collided with a motorcycle at an intersection.",
        "A pedestrian was nearly hit by a speeding motorcycle."
      ],
      "captions": [
        {
          "caption_id": "video_002_caption1",
          "text": "I nearly got hit by a reckless right-turning driver who didn’t even bother to yield. Some people never learn. #drivingfail",
          "control_scores": {
            "tone": {
              "Critical": "Strong", "Angry": "Strong"
            },
            "writing_style": {
              "Judgmental": "Very Strong"
            }
          },
          "application": "Law Enforcement Alert"
        },
        {
          "caption_id": "video_002_caption2",
          "text": "Dashcam footage from Osaka captures a tense moment as a right-turning car fails to yield, narrowly missing the camera vehicle. Grateful this near-miss ended safely. 🚗💥 #RoadSafety #DashcamDrama",
          "control_scores": {
            "tone": {
              "Appreciative": "Strong",
              "Tense": "Strong"
            },
            "writing_style": {
              "Factual": "Very Strong"
            }
          },
          "application": "Law Enforcement Alert"
        },
        {
          "caption_id": "video_002_caption3",
          "text": "Was I just supposed to guess that car was about to dart in front of me? Near-miss moments like this really make me wonder… 🚗💥 Anyone else get surprised by these moves? #RoadRage",
          "control_scores": {
            "tone": {
              "Anxious": "Very Strong"
            },
            "writing_style": {
              "Rhetorical Question": "Strong", "Conversational": "Very Strong"
            }
          },
          "application": "Law Enforcement Alert"
        }
      ]
    },
    {
      "video_id": "video_004",
      "video_path": "media/v_1740563927124296059_EKhCnd-cJchesHdB.mp4",
      "video_summary": "A daytime road event in Hyderabad, India, captured by a hand-held or cell-phone camera, depicts multiple traffic violations endangering pedestrian safety. The key event involved vehicles, including an orange car, failing to stop at a red light and making illegal U-turns. Other vehicles also did not stop before zebra crossings, while an auto-rickshaw was observed obstructing a lane. Pedestrians were seen crossing the road even though their signal was still red, amidst the disregard for traffic rules by drivers.",
      "road_event_answer": "Multiple vehicles run a red light and make illegal U-turns while pedestrians are crossing against their signal.",
      "distractor_answers": [
        "A cyclist ran a red light and was almost hit by a car.",
        "Two cars collided at high speed on a motorway.",
        "A driver was ticketed for using a phone while driving through a roundabout."
      ],
      "captions": [
        {
          "caption_id": "video_004_caption1",
          "text": "Did I just see everyone ignore the red light, or am I missing some new rule here?",
          "control_scores": {
            "tone": {
              "Sarcastic": "Very Strong",
              "Questioning": "Strong"
            },
            "writing_style": {
              "Conversational": "Strong"
            }
          },
          "application": "Public Safety Alert"
        },
        {
          "caption_id": "video_004_caption2",
          "text": "I watched drivers run red lights, ignore zebra crossings, and make illegal U-turns while pedestrians crossed on a red. It’s frustrating seeing such disregard for safety.",
          "control_scores": {
            "tone": {
              "Critical": "Strong"
            },
            "writing_style": {
              "Judgmental": "Very Strong",
              "Factual": "Very Strong"
            }
          },
          "application": "Public Safety Awareness"
        },
        {
          "caption_id": "video_004_caption3",
          "text": "I just watched Hyderabad chaos—wow, what a show! 🚦🤯 #Hyderabad",
          "control_scores": {
            "tone": {
              "Amusing": "Strong"
            },
            "writing_style": {
              "Exaggeration": "Very Strong",
              "Conversational": "Strong"
            }
          },
          "application": "Driver Behavior Monitoring"
        }
      ]
    }
  ],
  "part2_comparisons": [
    {
      "comparison_id": "comp_001",
      "video_id": "video_009",
      "video_path": "media/v_1781029134916784442_HwWaSpaenWbLCXo7.mp4",
      "video_summary": "A vehicle-mounted camera captured a traffic violation at night in Brampton, Ontario, Canada. A car stopped at an intersection with traffic lights, positioning itself incorrectly beyond the designated stop line while the light was red. The road surface was wet during the event.",
      "road_event_answer": "A car stops beyond the designated stop line at a red light.",
      "distractor_answers": [
        "A group of motorcyclists were participating in an organized race.",
        "A car collided with a motorcycle at an intersection.",
        "A pedestrian was nearly hit by a speeding motorcycle."
      ],
      "control_scores": {
        "tone": {
          "Amusing": "Strong",
          "Casual": "Strong"
        },
        "writing_style": {
          "Exaggeration": "Strong"
        }
      },
      "caption_A": "Brampton nights really bringing out the creative drivers 😂. Wet roads and wild stops! #Brampton",
      "caption_B": "Brampton nights really bringing out the creative drivers 😂. Wet roads and wild stops! #Brampton"
    },
    {
      "comparison_id": "comp_002",
      "video_id": "video_007",
      "video_path": "media/v_988741606391009282_aG9gbwBWJLQVFXT_.mp4",
      "video_summary": "A dashcam captured a daytime traffic accident in Japan where a Nissan Note ran a red light at an intersection and collided with the side of a Suzuki Carry light truck. The primary reason for the accident was the Nissan Note's red light violation. The Suzuki Carry sustained damage to its side from the impact, but there were no reported casualties, and its occupants were uninjured.",
      "road_event_answer": "A Nissan car ran a red light and collided with the side of a Suzuki truck.",
      "distractor_answers": [
        "A Suzuki truck failed to yield and was hit by a Nissan car.",
        "Two drivers were arguing after a minor parking incident.",
        "A red light was malfunctioning, causing a collision at an intersection."
      ],
      "control_scores": {
        "tone": {
          "Objective": "Very Strong",
          "Serious": "Strong"
        },
        "writing_style": {
          "Conversational": "Very Strong"
        }
      },
      "caption_A": "A Nissan Note ran a red light at an intersection and collided with the side of a Suzuki Carry, causing damage to the truck’s side. No injuries or casualties were reported from the accident.",
      "caption_B": "A Nissan Note ran a red light at an intersection and collided with the side of a Suzuki Carry, causing damage to the truck’s side. No injuries or casualties were reported from the accident."
    },
    {
      "comparison_id": "comp_003",
      "video_id": "video_005",
      "video_path": "media/v_921439559250038784_P14L18RmB2Nh7wA4.mp4",
      "video_summary": "A dashcam captured unsafe driving behavior, specifically lane hogging, on the M61 Northbound motorway in the UK during the daytime. Multiple vehicles were involved, occupying the middle lane and failing to move to the left lane when it was clear, which constitutes improper lane usage on a motorway.",
      "road_event_answer": "Multiple vehicles were improperly occupying the middle lane on a motorway instead of moving to the left.",
      "distractor_answers": [
        "A vehicle was pulled over by police for speeding in the right lane.",
        "Heavy traffic caused a complete standstill on the motorway.",
        "A driver was changing lanes without using a turn signal."
      ],
      "control_scores": {
        "tone": {
          "Sarcastic": "Very Strong",
          "Amusing": "Strong"
        },
        "writing_style": {
          "Exaggeration": "Strong",
          "Metaphorical": "Very Strong"
        }
      },
      "caption_A": "Middle lane on the M61 Northbound: where cars roam free, rules take a nap, and @HighwaysEngland lane discipline must be a bedtime story.",
      "caption_B": "Middle lane on the M61 Northbound: where cars roam free, rules take a nap, and @HighwaysEngland lane discipline must be a bedtime story."
    },
    {
      "comparison_id": "comp_004",
      "video_id": "video_008",
      "video_path": "media/v_1788433740043272490_Sfyt0MJb5efc8XNY.mp4",
      "video_summary": "A vehicle-mounted camera recorded hazardous driving conditions caused by extreme weather in Nagpur city, India, during the morning. The vehicle from which the video was captured had halted due to the severe weather, which also affected other vehicles present on the road.",
      "road_event_answer": "A vehicle has stopped on the road due to hazardous driving conditions from extreme weather.",
      "distractor_answers": [
        "Pedestrians were crossing the street outside of the designated crosswalks.",
        "A traffic light at a busy intersection was not working.",
        "A car was double-parked, blocking traffic at a stop sign."
      ],
      "control_scores": {
        "tone": {
          "Dramatic": "Very Strong",
          "Observant": "Strong"
        },
        "writing_style": {
          "Exaggeration": "Strong"
        }
      },
      "caption_A": "Absolutely wild weather hit Nagpur at 7am—visibility vanished, roads turned chaotic, and I had to pull over as everything just stopped. #NagpurWeather #India",
      "caption_B": "Absolutely wild weather hit Nagpur at 7am—visibility vanished, roads turned chaotic, and I had to pull over as everything just stopped. #NagpurWeather #India"
    }
  ],
  "part3_intensity_change": [
    {
      "change_id": "change_002",
      "video_id": "video_001",
      "video_path": "media/v_1772082398257127647_PAjmPcDqmPNuvb6p.mp4",
      "video_summary": "A severe car accident, captured by multiple cameras, occurred in Brampton, Ontario, Canada. The key road event involved a dark-colored sports car that reportedly came flying over a fence at high speed, resulting in it being severely damaged and overturned with its front end crumpled and debris scattered. The driver and passenger of the sports car fled the scene, constituting a hit-and-run. A white Toyota Tacoma pickup truck was also involved, sustaining a detached front bumper. The incident took place near two-story brick residential houses and power lines. Bystanders were observed assessing the situation and offering assistance. The traffic violations associated with this event include speeding, reckless driving, and fleeing the scene of an accident.",
      "road_event_answer": "A sports car crashed at high speed, and the occupants fled the scene.",
      "distractor_answers": [
        "A police chase ended with a suspect being arrested after a crash.",
        "A pickup truck was involved in a minor collision with a fence.",
        "A driver was practicing stunts in a residential area."
      ],
      "caption_A": "A car suddenly flips over, sending debris everywhere— so unsettling to watch. People rush away, unsure what just happened. 🚗💥 #Crash #RoadDrama",
      "caption_B": "My heart races watching this—out of nowhere, a car comes crashing over a fence, metal everywhere, people running. It’s so overwhelming. #CarCrash 😰",
      "field_to_change": {
        "tone": "Emotional"
      },
      "change_type": "increased"
    },
    {
      "change_id": "change_003",
      "video_id": "video_001",
      "video_path": "media/v_1772082398257127647_PAjmPcDqmPNuvb6p.mp4",
      "video_summary": "A severe car accident, captured by multiple cameras, occurred in Brampton, Ontario, Canada. The key road event involved a dark-colored sports car that reportedly came flying over a fence at high speed, resulting in it being severely damaged and overturned with its front end crumpled and debris scattered. The driver and passenger of the sports car fled the scene, constituting a hit-and-run. A white Toyota Tacoma pickup truck was also involved, sustaining a detached front bumper. The incident took place near two-story brick residential houses and power lines. Bystanders were observed assessing the situation and offering assistance. The traffic violations associated with this event include speeding, reckless driving, and fleeing the scene of an accident.",
      "road_event_answer": "A sports car crashed at high speed, and the occupants fled the scene.",
      "distractor_answers": [
        "A police chase ended with a suspect being arrested after a crash.",
        "A pickup truck was involved in a minor collision with a fence.",
        "A driver was practicing stunts in a residential area."
      ],
      "caption_A": "Speeding and reckless driving can lead to devastating crashes. Always stay alert and drive responsibly. 🚨 #RoadSafety #DrivingTips",
      "caption_B": "A car suddenly flips over, sending debris everywhere— so unsettling to watch. People rush away, unsure what just happened. 🚗💥 #Crash #RoadDrama",
      "field_to_change": {
        "writing_style": "Advisory"
      },
      "change_type": "decreased"
    }
  ]
}