{
  "Tweet_ID": "1703606261588390352",
  "TweetURL": "https://twitter.com/dhans4all/status/1703606261588390352",
  "RoadEventRelated": true,
  "QA_file": "qa_1703606261588390352.json",
  "VideoName": "Z2L25V3LkQdLUVxM.mp4",
  "QAs": [
    {
      "Q": "What type of camera was used to capture the video?",
      "QA-group": "Factual",
      "QA-task": "Viewpoint",
      "QA-subtask": "Viewpoint",
      "Q-type": "Generic",
      "A": "The video was likely captured using a cell-phone camera or hand-held camera"
    },
    {
      "Q": "What type of road event is depicted in the video?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "RoadEvent_Type",
      "Q-type": "Generic",
      "A": "The key road event captured in the video is dangerous and rash driving, specifically a motorcyclist performing wheelies at high speed on a busy road with other vehicles present."
    },
    {
      "Q": "In which country did this road event take place?",
      "QA-group": "Factual",
      "QA-task": "Where",
      "QA-subtask": "Country_location",
      "Q-type": "Generic",
      "A": "This road event took place in India."
    },
    {
      "Q": "On which type of road or area, this event have taken place?",
      "QA-group": "Factual",
      "QA-task": "Where",
      "QA-subtask": "Road_type",
      "Q-type": "Generic",
      "A": "The event took place on a busy urban road."
    },
    {
      "Q": "What were the weather and road conditions during the event?",
      "QA-group": "Factual",
      "QA-task": "Where",
      "QA-subtask": "Weather_conditions",
      "Q-type": "Generic",
      "A": "The weather conditions were cloudy with wet roads, suggesting recent rainfall."
    },
    {
      "Q": "What entities are involved in the road event?",
      "QA-group": "Factual",
      "QA-task": "Key Entities",
      "QA-subtask": "Key_Entities",
      "Q-type": "Generic",
      "A": "The road entities involved include a motorcycle performing wheelies, other vehicles on the road, and pedestrians or bystanders who might be at risk."
    },
    {
      "Q": "Can you describe the actions of the motorcyclist in the video?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "What/Actions_of_key_entities",
      "Q-type": "Generic",
      "A": "The main action was the motorcyclist performing wheelies at high speed among other moving vehicles."
    },
    {
      "Q": "What might be the reason behind the motorcyclist's actions?",
      "QA-group": "Complex",
      "QA-task": "Why",
      "QA-subtask": "Intention",
      "Q-type": "Generic",
      "A": "The suspected motive behind the motorcyclist's actions could be thrill-seeking or showing off."
    },
    {
      "Q": "What traffic violations are evident in the video?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "Traffic_Violation",
      "Q-type": "Generic",
      "A": "The traffic rule violations include reckless driving, performing stunts on a public road, and endangering other road users."
    },
    {
      "Q": "What actions could be taken in response to witnessing this unsafe driving behavior?",
      "QA-group": "Imaginative",
      "QA-task": "Advisory",
      "QA-subtask": "Post-event/Disciplinary_measures",
      "Q-type": "Generic",
      "A": "Measures that should be taken include reporting the incident to the police, imposing fines, suspending or revoking the rider's license, and potentially confiscating the vehicle."
    },
    {
      "Q": "What road safety advice is relevant to this situation?",
      "QA-group": "Imaginative",
      "QA-task": "Advisory",
      "QA-subtask": "Road_Safety_Advisory",
      "Q-type": "Generic",
      "A": "Road safety advisories include: Avoid performing stunts on public roads, maintain safe speeds, be aware of other road users, and follow traffic rules at all times."
    },
    {
      "Q": "Can you specify the approximate time interval where the key road event is observed in the video? (The time interval should be specified in the format: xx to yy seconds)",
      "QA-group": "Complex",
      "QA-task": "Grounding",
      "QA-subtask": "Temporal_Grounding",
      "Q-type": "Generic",
      "A": "The key road event is observed between 1 to 4 seconds."
    },
    {
      "Q": "What specific dangerous maneuver was the motorcyclist performing in the video?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "What/Actions_of_key_entities",
      "Q-type": "Specific",
      "A": "The motorcyclist was performing wheelies at high speed on a busy road."
    },
    {
      "Q": "What type of road was this dangerous event taking place on?",
      "QA-group": "Factual",
      "QA-task": "Where",
      "QA-subtask": "Road_type",
      "Q-type": "Specific",
      "A": "The event took place on a busy urban road with other vehicles present."
    },
    {
      "Q": "What were the specific weather and road conditions during this incident?",
      "QA-group": "Factual",
      "QA-task": "Where",
      "QA-subtask": "Weather_conditions",
      "Q-type": "Specific",
      "A": "The weather was cloudy with wet road conditions, indicating recent rainfall."
    },
    {
      "Q": "Who were the key entities at risk during this dangerous road event?",
      "QA-group": "Factual",
      "QA-task": "Key Entities",
      "QA-subtask": "Key_Entities",
      "Q-type": "Specific",
      "A": "The key entities at risk were the motorcyclist, other vehicles on the road, and potentially pedestrians or bystanders."
    },
    {
      "Q": "What specific traffic laws did the motorcyclist violate in this incident?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "Traffic_Violation",
      "Q-type": "Specific",
      "A": "The motorcyclist violated laws against reckless driving, performing stunts on a public road, and endangering other road users."
    },
    {
      "Q": "What psychological factor might be driving the motorcyclist's dangerous behavior?",
      "QA-group": "Complex",
      "QA-task": "Why",
      "QA-subtask": "Intention",
      "Q-type": "Specific",
      "A": "The motorcyclist's actions suggest thrill-seeking behavior or a desire to show off to others."
    },
    {
      "Q": "What immediate actions should be taken by authorities in response to this incident?",
      "QA-group": "Imaginative",
      "QA-task": "Advisory",
      "QA-subtask": "Post-event/Disciplinary_measures",
      "Q-type": "Specific",
      "A": "Authorities should report the incident, impose fines, consider suspending or revoking the rider's license, and potentially confiscate the motorcycle."
    },
    {
      "Q": "What specific road safety advice would prevent such incidents in the future?",
      "QA-group": "Imaginative",
      "QA-task": "Advisory",
      "QA-subtask": "Road_Safety_Advisory",
      "Q-type": "Specific",
      "A": "Key safety advice includes: never perform stunts on public roads, maintain appropriate speeds, always be aware of other road users, and strictly adhere to all traffic rules."
    },
    {
      "Q": "How does this incident highlight the importance of responsible motorcycling?",
      "QA-group": "Complex",
      "QA-task": "Description",
      "QA-subtask": "RoadEvent_Type",
      "Q-type": "Specific",
      "A": "This incident emphasizes that irresponsible motorcycling can endanger not only the rider but also other road users, underscoring the need for safe and considerate riding practices."
    },
    {
      "Q": "What type of recording device would likely capture such an incident clearly?",
      "QA-group": "Factual",
      "QA-task": "Viewpoint",
      "QA-subtask": "Viewpoint",
      "Q-type": "Specific",
      "A": "This type of incident would likely be captured clearly by a high-quality smartphone camera or a dedicated dashcam with good motion tracking capabilities."
    },
    {
      "Q": "Was there a police chase involved in this incident?",
      "QA-group": "Hallucination",
      "QA-task": "Adversarial",
      "QA-subtask": "Adversarial",
      "Q-type": "Specific",
      "A": "There is no evidence of a police chase in this video. The video shows a motorcyclist performing dangerous stunts on a busy urban road, but does not depict any police involvement or pursuit."
    },
    {
      "Q": "Did any emergency vehicles respond to the scene during the video?",
      "QA-group": "Hallucination",
      "QA-task": "Adversarial",
      "QA-subtask": "Adversarial",
      "Q-type": "Specific",
      "A": "The video does not depict any emergency vehicles responding to the scene. The incident shows a motorcyclist performing dangerous stunts, but there's no mention or visibility of police cars, ambulances, or fire trucks arriving at the location."
    },
    {
      "Q": "Did the motorcyclist collide with any other vehicles?",
      "QA-group": "Hallucination",
      "QA-task": "Adversarial",
      "QA-subtask": "Adversarial",
      "Q-type": "Specific",
      "A": "The video does not show any collision between the motorcyclist and other vehicles. While the motorcyclist was performing dangerous wheelies at high speed, there was no actual crash or impact captured in the footage."
    }
  ],
  "TweetVideoURLs": [
    "https://video.twimg.com/ext_tw_video/1703606231082958848/pu/vid/avc1/480x864/Z2L25V3LkQdLUVxM.mp4?tag=12"
  ],
  "Task-level_tags": {
    "Viewpoint": [
      "hand-held camera",
      "hand-held camera"
    ],
    "RoadEvent_Type": [
      "Dangerous or Rash driving"
    ],
    "Country_location": [
      "India"
    ],
    "Road_type": [
      "Urban and Suburban Roads"
    ],
    "Weather_conditions": [
      "Rainy Weather",
      "Wet Surfaces / Conditions",
      "Cloudy Weather"
    ],
    "What/Actions_of_key_entities": [
      "Roadway Navigation",
      "Speeding/High Speed",
      "Reckless and Unlawful Driving"
    ],
    "Traffic_Violation": [
      "Reckless & Negligent Driving"
    ]
  },
  "Video-level_tags": [
    "Dangerous stunts",
    "Reckless driving",
    "Wheelie",
    "Traffic violation",
    "Public safety risk",
    "Motorcycle stunts",
    "High-speed riding",
    "Urban road hazard",
    "Irresponsible motorcyclist",
    "Endangering road users"
  ],
  "caption": "He was doing wheelies at high speed just seconds before the accident, and while other vehicles were passing.\n\nHe is a threat to society; I hope legal action is taken against him, at least now.",
  "qa_path": "qa_1703606261588390352.json",
  "video_path": "v_1703606261588390352_Z2L25V3LkQdLUVxM.mp4",
  "tweet_user": "dhans4all",
  "video_summary": "A video, likely captured using a cell-phone or hand-held camera, depicts a dangerous and rash driving event in India. The key road event involves a motorcyclist performing wheelies at high speed on a busy road, amidst other moving vehicles and potential pedestrians. The motorcyclist's actions, suspected to be for thrill-seeking or showing off, constitute multiple traffic violations including reckless driving, performing stunts on a public road, and endangering other road users.",
  "is_english": "No",
  "lang": "ta",
  "annotations": {
    "Personality": {
      "Adventurous": 0.9,
      "Daring": 0.8,
      "Playful": 0.6,
      "Enthusiastic": 0.7,
      "Amusing": 0.5
    },
    "Writing Style": {
      "Instructional": 0.0,
      "Exaggeration": 0.7,
      "Judgemental": 0.4,
      "Pop Culture References": 0.0,
      "Conversational": 0.7,
      "Advisory": 0.0,
      "Rhetorical Question": 0.0,
      "Factual": 0.0,
      "Understatement": 0.0,
      "Metaphorical": 0.0,
      "Motivational": 0.0,
      "Persuasive": 0.0,
      "CallToAction": 0.0,
      "Analogy": 0.0,
      "Proverbial": 0.0,
      "Suspense": 0.0
    },
    "word_count": 26,
    "Informativeness": 0.7,
    "Factual Attributes": {
      "User Mentions": "yes",
      "Hashtags": "yes",
      "Emojis": "yes",
      "Date/Time": "no",
      "Location": "yes",
      "First-Person Perspective": "yes"
    }
  }
}